package com.course.onseo;
import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.lang.management.BufferPoolMXBean;
public class javarush {
/*    public static void main(String[] args) throws Exception {
        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        double time = Double.parseDouble(reader.readLine());
        time = time % 5;
        if (time >= 0& time <3){
            System.out.println("green");
        } else if (time >= 3 && time <4){
            System.out.println("Yellow");
        } else {
            System.out.println("red");
        }
    }
}
Работа светофора для пешеходов запрограммирована следующим образом:
в начале каждого часа в течение трех минут горит зелёный сигнал,
затем в течение одной минуты - жёлтый,
а потом в течение одной минуты - красный,
затем опять зелёный горит три минуты и т. д.
Ввести с клавиатуры вещественное число t, означающее время в минутах, прошедшее с начала очередного часа.
Определить, сигнал какого цвета горит для пешеходов в этот момент.
Результат вывести на экран в следующем виде:
"зелёный" - если горит зелёный цвет,
"жёлтый" - если горит жёлтый цвет,
"красный" - если горит красный цвет.
Пример для числа 2.5: зелёный
Пример для числа 3: жёлтый
Пример для числа 4: красный
Пример для числа 5: зелёный
Требования:
- Програма должна считывать вещественное число с клавиатуры;
- Програма должна выводить текст на экран4
- Если горит зеленый цвет нужно вывести текст: "зеленый";
- Если горит желтый цвет нужно вывести текст: "желтый";
- Если горит красный цвет нужно вывести текст: "красный";
*/
//Level 4-10
public static void main(String[] args) {
    int i = 1;
    while (i <= 10){
        System.out.println(i);
        i++;
    }
}



}