package com.My.JavaRush.level_4_16;

public class Lessons0401 {
    public static void main(String[] args) {
        for (int i = 1; i <=100 ; i++) {
            System.out.println("Я никогда не буду работать за копейки. Амиго");
        }
    }
}

/*
Используя цикл вывести на экран сто раз надпись:
"Я никогда не буду работать за копейки. Амиго"
Каждое значение вывести с новой строки.
Требования:
- програма не должна считывать текст с клавиатуры
- програм адолжна виводить текст на экран;
- програма должна виводить 100 раз текст указаный в задании.
- в програме должен использаваться цикл for или while.

 */