package com.My.JavaRush.level_4_13;

public class Exercise01 {
    public static void main(String[] args) {
        int i = 1;
        for (i=2; i<=100; i++){
            System.out.println(i);
            i++;
        }

    }

}


/*

Используя цикл for вывести на экран чётные числа от 1 до 100 включительно.
Каждое значение вывести с новой строки.
Требования:

- програма не должна считывать текст с клавиатуры;
- програма должна выводить ттекст на екран;
- програма должна выводить четные числа от 1 до 100 включительно.
  каждое значение вывести с новой строки;
- в програме должен использоваться цикл for.

 */