package com.My.JavaRush.level_4_13;

public class Exercise04 {
    public static void main(String[] args) {
        int i = 8;

        for (i=1; i <10; i++){
            System.out.print("8");
        }
        for (i=0; i <=10; i++){
            System.out.println("8");
        }
    }
}

/*
Используя цикл for вывести на экран:
- горизонтальную линию из 10 восьмёрок
- вертикальную линию из 10 восьмёрок (символ из горизонтальной строки не учитывается).
Требования:
- програма не должна считывать текст с клавиатуры;
- програма должна выводить текст на екран;
- програма должна выводить горизонтальную линию из 10 восьмерок;.
- програма должна выводить вертикальную линию из 10 восьмерок;
- в програме должен использоваться цикл for.
*/